function GreyPrediction
x0=[1,1.50000000000000,1.83333333333333,2.23333333333333,2.51904761904762,2.74126984126984,3.04896214896215,3.18229548229548,3.24479548229548,3.35590659340659,3.40853817235396,3.54490180871760,3.62823514205093,3.73934625316204,3.80831177040342];         
m = 2
N = length(x0)

f=x0;      
                             %f用于保留原值！

%灰色预测计算模型
x1=[];                                  %此处不需加数据
n=N;                                    %N需修改
for k=1:n
     if k==1 
        x1(k)=x0(k);
     else x1(k)=x1(k-1)+x0(k);
     end
   end;                                 %计算x1()
 
n=n-1;
B=ones(n,2);
for i=1:n
    B(i,1)=-0.5*(x1(i)+x1(i+1));
end                                     %参数B

x0(:,1)=[];
Y=x0';                                  %参数Y

A=inv(B'*B)*B'*Y;                       %可知a和u
a=A(1);
u=A(2);


%模型标定求x'1
n=n+1+m;                                %m为向后预测的年数,需修改!
x11(1)=f(1);
for j=2:n
    x11(j)=(f(1)-u/a)*exp(-a*(j-1))+u/a;
end


%用灰色模型计算x'0
x01(1)=f(1);
for k=2:n
    x01(k)=x11(k)-x11(k-1);
end
%计算残差e0(i)和相对误差t0(i)
for j=1:N                               %N需修改
    e0(j)=x01(j)-f(j);
    t0(j)=e0(j)/f(j);
end

%绘制预测值及原值曲线
n=N;                                   %N需修改
year1=1:n;
year2=1:n+m;                           %m需修改！
subplot(2,1,1);plot(year1,f,'-*',year2,x01,'-+')
xlabel('年份')
ylabel('原值（*）及预测值（+）')
title('预测图')
subplot(2,1,2);plot(year1,e0,'*',year1,t0,'+')
xlabel('年份')
ylabel('残差（*）及相对误差（+）')
title('误差图')



%判断预测精度
disp('完成预测')
a=abs(a)
if a<=0.3
        disp('可进行中长期预测')
elseif a<=0.5
        disp('可用于短期预测,中长期预测慎用')
elseif a<=0.8
        disp('作短期预测应十分谨慎')
else
        disp('不宜预测')
end